-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/kolesarm/research/R-packages/multe/data-raw/fryer_levitt_tests.log
  log type:  text
 opened on:  15 Aug 2023, 16:04:08

. use mental.dta, clear

. 
. global base_9months "i.age_9 female"

. global base_2years "i.age_24 female"

. global prenatal "i.birthweight i.days_premature i.multiple_birth"

. global home "i.siblings i.family_structure i.region c.mom_age##c.mom_age##c.mom_age##c.mom_age##c.mom_age mom_age_NA c.pare
> nt_score##c.parent_score##c.parent_score##c.parent_score##c.parent_score parent_score_NA"

. 
. qui: eststo r1: reg std_iq_24 i.race $base_2years [pw=W2C0], robust

. qui: mlogit race $base_2years [pw=W2C0], robust

. disp e(chi2)
44.380661

. disp e(df_m)
16

. disp e(p)
.00017261

. qui: eststo a1: reg std_iq_24 i.race $base_2years [pw=W2C0] if (1.race | 0.race), robust

. qui: eststo a2: reg std_iq_24 i.race $base_2years [pw=W2C0] if (2.race | 0.race), robust

. qui: eststo a3: reg std_iq_24 i.race $base_2years [pw=W2C0] if (3.race | 0.race), robust

. qui: eststo a4: reg std_iq_24 i.race $base_2years [pw=W2C0] if (4.race | 0.race), robust

. 
. qui: eststo r2: reg std_iq_24 i.race $base_2years, robust

. qui: mlogit race $base_2years, robust

. disp e(chi2)
55.247999

. disp e(df_m)
16

. disp e(p)
3.237e-06

. 
. * ATE
. tabulate age_24, generate(age_24a)

     age_24 |      Freq.     Percent        Cum.
------------+-----------------------------------
         23 |      3,481       39.53       39.53
         24 |      3,415       38.78       78.31
         25 |      1,177       13.37       91.68
         26 |        733        8.32      100.00
------------+-----------------------------------
      Total |      8,806      100.00

. drop age_24a4

. foreach v of varlist age_24a* female  {
  2.     qui: summarize `v'
  3.     generate `v'd = `v' - r(mean)
  4. }

. foreach v of varlist age_24a* female  {
  2.     qui: summarize `v' [w=W2C0]
  3.     generate `v'w = `v' - r(mean)
  4. }

. 
. qui: eststo r3: reg std_iq_24 i.race##c.femaled i.race##c.age_24a*d, robust

. qui: eststo r4: reg std_iq_24 i.race##c.femalew i.race##c.age_24a*w [pw=W2C0], robust

. 
. qui: eststo b1: reg std_iq_24 i.race $base_2years if (1.race | 0.race), robust

. qui: eststo b2: reg std_iq_24 i.race $base_2years if (2.race | 0.race), robust

. qui: eststo b3: reg std_iq_24 i.race $base_2years if (3.race | 0.race), robust

. qui: eststo b4: reg std_iq_24 i.race $base_2years if (4.race | 0.race), robust

. 
. esttab r1 r2 r3 r4, b(%13.11f) se(%13.11f) wide keep(*.race)

-----------------------------------------------------------------------------------------------------------------------------
> ---
                      (1)                          (2)                          (3)                          (4)             
>    
                std_iq_24                    std_iq_24                    std_iq_24                    std_iq_24             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
0.race       0.00000000000             (.) 0.00000000000             (.) 0.00000000000             (.) 0.00000000000         
>     (.)
1.race       -0.38214850861*** (0.02719998765) -0.40307948873*** (0.02255093624) -0.40288196461*** (0.02261904824) -0.3822404
> 6376*** (0.02711806252)
2.race       -0.43152780424*** (0.02417352945) -0.37190206761*** (0.01986720365) -0.37246500815*** (0.01988929344) -0.4322009
> 3709*** (0.02410508539)
3.race       -0.21524163702*** (0.03530655165) -0.02956472195    (0.02849451882) -0.03029817036    (0.02850617942) -0.2149478
> 8553*** (0.03521886966)
4.race       -0.23674243795*** (0.03861460940) -0.14465188134*** (0.02519070865) -0.14366763851*** (0.02521682508) -0.2391843
> 6629*** (0.03811401253)
-----------------------------------------------------------------------------------------------------------------------------
> ---
N                    8806                         8806                         8806                         8806             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. esttab a1 a2 a3 a4, b(%13.11f) se(%13.11f) wide keep(*.race)

-----------------------------------------------------------------------------------------------------------------------------
> ---
                      (1)                          (2)                          (3)                          (4)             
>    
                std_iq_24                    std_iq_24                    std_iq_24                    std_iq_24             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
0.race       0.00000000000             (.) 0.00000000000             (.) 0.00000000000             (.) 0.00000000000         
>     (.)
1.race       -0.38148645623*** (0.02723553124)                                                                               
>         
2.race                                    -0.43108713219*** (0.02420140436)                                                  
>         
3.race                                                                 -0.21425083309*** (0.03532753684)                     
>         
4.race                                                                                              -0.23674282596*** (0.0384
> 6944309)
-----------------------------------------------------------------------------------------------------------------------------
> ---
N                    5187                         5573                         4681                         4744             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. esttab b1 b2 b3 b4, b(%13.11f) se(%13.11f) wide keep(*.race)

-----------------------------------------------------------------------------------------------------------------------------
> ---
                      (1)                          (2)                          (3)                          (4)             
>    
                std_iq_24                    std_iq_24                    std_iq_24                    std_iq_24             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
0.race       0.00000000000             (.) 0.00000000000             (.) 0.00000000000             (.) 0.00000000000         
>     (.)
1.race       -0.40219798717*** (0.02260901078)                                                                               
>         
2.race                                    -0.37128881274*** (0.01990755363)                                                  
>         
3.race                                                                 -0.02883618306    (0.02852013390)                     
>         
4.race                                                                                              -0.14445474649*** (0.0251
> 9154792)
-----------------------------------------------------------------------------------------------------------------------------
> ---
N                    5187                         5573                         4681                         4744             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. qui: eststo r5: reg std_iq_24 i.race i.days_premature if (days_premature~=56), cluster(interviewer_ID_24)

. qui: mlogit race i.days_premature if (days_premature~=56), cluster(interviewer_ID_24)

. disp e(chi2)
431.75865

. disp e(df_m)
44

. disp e(p)
3.973e-65

. esttab r5, b(%13.11f) se(%13.11f) wide keep(*.race)

-----------------------------------------
                      (1)                
                std_iq_24                
-----------------------------------------
0.race       0.00000000000             (.)
1.race       -0.33333797225*** (0.03687299020)
2.race       -0.37248246561*** (0.03515234694)
3.race       -0.11613548296*   (0.04527212475)
4.race       -0.17710303864*** (0.03041754158)
-----------------------------------------
N                    8695                
-----------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. qui: eststo a1: reg std_iq_24 i.race i.days_premature if (days_premature~=56 & (1.race | 0.race)), cluster(interviewer_ID_2
> 4)

. qui: eststo a2: reg std_iq_24 i.race i.days_premature if (days_premature~=56 & (2.race | 0.race)), cluster(interviewer_ID_2
> 4)

. qui: eststo a3: reg std_iq_24 i.race i.days_premature if (days_premature~=56 & (3.race | 0.race)), cluster(interviewer_ID_2
> 4)

. qui: eststo a4: reg std_iq_24 i.race i.days_premature if (days_premature~=56 & (4.race | 0.race)), cluster(interviewer_ID_2
> 4)

. esttab a1 a2 a3 a4, b(%13.11f) se(%13.11f) wide keep(*.race)

-----------------------------------------------------------------------------------------------------------------------------
> ---
                      (1)                          (2)                          (3)                          (4)             
>    
                std_iq_24                    std_iq_24                    std_iq_24                    std_iq_24             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
0.race       0.00000000000             (.) 0.00000000000             (.) 0.00000000000             (.) 0.00000000000         
>     (.)
1.race       -0.33240359957*** (0.03685028050)                                                                               
>         
2.race                                    -0.37355435179*** (0.03512567769)                                                  
>         
3.race                                                                 -0.11988633341**  (0.04576031374)                     
>         
4.race                                                                                              -0.17712550552*** (0.0300
> 3805330)
-----------------------------------------------------------------------------------------------------------------------------
> ---
N                    5105                         5499                         4625                         4677             
>    
-----------------------------------------------------------------------------------------------------------------------------
> ---
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. * TODO: ATE
. preserve

. keep if days_premature~=56
(111 observations deleted)

. tabulate days_premature, generate(days_a)

 days_premature |      Freq.     Percent        Cum.
----------------+-----------------------------------
              0 |      6,326       72.75       72.75
              7 |        545        6.27       79.02
             14 |        373        4.29       83.31
             21 |        265        3.05       86.36
             28 |        168        1.93       88.29
             35 |        146        1.68       89.97
             42 |        145        1.67       91.64
             49 |        149        1.71       93.35
             63 |        119        1.37       94.72
             70 |        107        1.23       95.95
             77 |        196        2.25       98.21
not ascertained |        156        1.79      100.00
----------------+-----------------------------------
          Total |      8,695      100.00

. 
. * drop days_prematurea
. foreach v of varlist days_a*  {
  2.     qui: summarize `v'
  3.     generate `v'd = `v' - r(mean)
  4. }

. qui: eststo ra1: reg std_iq_24 i.race##c.days_a*d, cluster(interviewer_ID_24)

. esttab ra1, b(%13.11f) se(%13.11f) wide keep(*.race)

-----------------------------------------
                      (1)                
                std_iq_24                
-----------------------------------------
0.race       0.00000000000             (.)
1.race       -0.33471482887*** (0.03738957252)
2.race       -0.37256507935*** (0.03527493811)
3.race       -0.08299865304    (0.04533840296)
4.race       -0.19372967175*** (0.03025915812)
-----------------------------------------
N                    8695                
-----------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. restore

. 
. * qui: eststo r4: areg std_iq_24 i.race $base_2years i.SES_quintile $home $prenatal [pw=W2C0] , absorb(interviewer_ID_24)
. 
. * binomial
. generate white = (race==0)

. qui: eststo r6: reg std_iq_24 i.white i.age_24 female [pw=W2C0], robust

. qui: eststo r7: reg std_iq_24 i.white##c.femalew i.white##c.age_24a*w [pw=W2C0], robust

. 
. esttab r6 r7, b(%13.11f) se(%13.11f) wide keep(1.white)

----------------------------------------------------------------------
                      (1)                          (2)                
                std_iq_24                    std_iq_24                
----------------------------------------------------------------------
1.white      0.38495380524*** (0.01955413026) 0.38504401394*** (0.01954185224)
----------------------------------------------------------------------
N                    8806                         8806                
----------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. logit white i.age_24 female [pw=W2C0], robust

Iteration 0:   log pseudolikelihood = -2714591.7  
Iteration 1:   log pseudolikelihood = -2699665.6  
Iteration 2:   log pseudolikelihood = -2699664.7  
Iteration 3:   log pseudolikelihood = -2699664.7  

Logistic regression                                     Number of obs =  8,806
                                                        Wald chi2(4)  =  36.99
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -2699664.7                       Pseudo R2     = 0.0055

------------------------------------------------------------------------------
             |               Robust
       white | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      age_24 |
         24  |   .2705996    .065252     4.15   0.000     .1427079    .3984912
         25  |  -.0742684   .0920741    -0.81   0.420    -.2547303    .1061935
         26  |  -.2960703   .1123807    -2.63   0.008    -.5163324   -.0758081
             |
      female |   .0099853   .0580079     0.17   0.863    -.1037082    .1236787
       _cons |    .076194   .0538041     1.42   0.157      -.02926     .181648
------------------------------------------------------------------------------

. disp e(chi2)
36.994275

. disp e(df_m)
4

. disp e(p)
1.806e-07

. 
. log close
      name:  <unnamed>
       log:  /home/kolesarm/research/R-packages/multe/data-raw/fryer_levitt_tests.log
  log type:  text
 closed on:  15 Aug 2023, 16:04:09
-----------------------------------------------------------------------------------------------------------------------------
