-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/kolesarm/research/R-packages/multe/data-raw/fryer_levitt_tests.log
  log type:  text
 opened on:   2 Aug 2023, 15:37:50

. use mental.dta, clear

. 
. global base_9months "i.age_9 female"

. global base_2years "i.age_24 female"

. global prenatal "i.birthweight i.days_premature i.multiple_birth"

. global home "i.siblings i.family_structure i.region c.mom_age##c.mom_age##c.mom_age##c.mom_age##c.mom_age mom_age_NA c.parent_score##c.parent_score##c.parent_score##c.parent_score##c.parent_score parent_score_NA"

. 
. qui: eststo r1: reg std_iq_24 i.race $base_2years [pw=W2C0], robust

. 
. qui: mlogit race $base_2years [pw=W2C0], robust

. disp e(chi2)
44.380661

. disp e(df_m)
16

. disp e(p)
.00017261

. 
. 
. * ATE
. tabulate age_24, generate(age_24a)

     age_24 |      Freq.     Percent        Cum.
------------+-----------------------------------
         23 |      3,481       39.53       39.53
         24 |      3,415       38.78       78.31
         25 |      1,177       13.37       91.68
         26 |        733        8.32      100.00
------------+-----------------------------------
      Total |      8,806      100.00

. 
. foreach v of varlist age_24a* female  {
  2.     summarize `v'
  3.     generate `v'd = `v' - r(mean)
  4. }

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_24a1 |      8,806    .3952987    .4889425          0          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_24a2 |      8,806    .3878038    .4872771          0          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_24a3 |      8,806    .1336589    .3403048          0          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_24a4 |      8,806    .0832387    .2762584          0          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      female |      8,806    .4905746    .4999395          0          1

. 
. eststo r2: reg std_iq_24 i.race##c.femaled i.race##c.age_24a*d [pw=W2C0], robust
(sum of wgt is 3,932,634.818)
note: age_24a4d omitted because of collinearity.
note: 1.race#c.age_24a4d omitted because of collinearity.
note: 2.race#c.age_24a4d omitted because of collinearity.
note: 3.race#c.age_24a4d omitted because of collinearity.
note: 4.race#c.age_24a4d omitted because of collinearity.

Linear regression                               Number of obs     =      8,806
                                                F(24, 8781)       =      31.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1388
                                                Root MSE          =     .68222

----------------------------------------------------------------------------------
                 |               Robust
       std_iq_24 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
            race |
          Black  |  -.3811987   .0269909   -14.12   0.000    -.4341072   -.3282902
       Hispanic  |  -.4317934   .0241061   -17.91   0.000    -.4790469   -.3845398
          Asian  |  -.2146155   .0350937    -6.12   0.000    -.2834074   -.1458236
          Other  |  -.2385843   .0379557    -6.29   0.000    -.3129864   -.1641822
                 |
         femaled |   .2622866   .0285005     9.20   0.000      .206419    .3181541
                 |
  race#c.femaled |
          Black  |  -.0661588   .0543708    -1.22   0.224    -.1727382    .0404207
       Hispanic  |  -.0507136   .0482713    -1.05   0.293    -.1453367    .0439095
          Asian  |  -.0566164   .0705279    -0.80   0.422    -.1948676    .0816348
          Other  |   .1126097   .0762996     1.48   0.140    -.0369554    .2621748
                 |
       age_24a1d |  -.4828307   .0692203    -6.98   0.000    -.6185186   -.3471427
       age_24a2d |  -.2962973    .069444    -4.27   0.000    -.4324239   -.1601707
       age_24a3d |  -.2637633   .0780049    -3.38   0.001    -.4166711   -.1108555
       age_24a4d |          0  (omitted)
                 |
race#c.age_24a1d |
          Black  |  -.1032358   .1011834    -1.02   0.308    -.3015789    .0951074
       Hispanic  |   -.062294   .1002917    -0.62   0.535    -.2588891    .1343012
          Asian  |  -.1132785   .1376157    -0.82   0.410    -.3830375    .1564805
          Other  |   .1896832   .1540835     1.23   0.218    -.1123565     .491723
                 |
race#c.age_24a2d |
          Black  |  -.0906775   .0999077    -0.91   0.364      -.28652    .1051649
       Hispanic  |  -.0768168   .1002928    -0.77   0.444    -.2734141    .1197805
          Asian  |  -.1376061   .1348842    -1.02   0.308    -.4020107    .1267985
          Other  |   .1636437    .153295     1.07   0.286    -.1368504    .4641378
                 |
race#c.age_24a3d |
          Black  |  -.0396395   .1141137    -0.35   0.728    -.2633292    .1840501
       Hispanic  |  -.0369032   .1138576    -0.32   0.746    -.2600907    .1862843
          Asian  |  -.1074524   .1574316    -0.68   0.495    -.4160552    .2011504
          Other  |   .2846492   .1705202     1.67   0.095    -.0496103    .6189087
                 |
race#c.age_24a4d |
          Black  |          0  (omitted)
       Hispanic  |          0  (omitted)
          Asian  |          0  (omitted)
          Other  |          0  (omitted)
                 |
           _cons |   .1828876   .0144298    12.67   0.000     .1546018    .2111735
----------------------------------------------------------------------------------

. 
. esttab r1 r2, b(%11.9f) se(%11.9f) wide keep(*.race)

----------------------------------------------------------------------
                      (1)                          (2)                
                std_iq_24                    std_iq_24                
----------------------------------------------------------------------
0.race        0.000000000             (.)  0.000000000             (.)
1.race       -0.382148509*** (0.027199988) -0.381198698*** (0.026990907)
2.race       -0.431527804*** (0.024173529) -0.431793351*** (0.024106071)
3.race       -0.215241637*** (0.035306552) -0.214615534*** (0.035093712)
4.race       -0.236742438*** (0.038614609) -0.238584265*** (0.037955724)
----------------------------------------------------------------------
N                    8806                         8806                
----------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. * qui: eststo r4: areg std_iq_24 i.race $base_2years i.SES_quintile $home $prenatal [pw=W2C0] , absorb(interviewer_ID_24)
. 
. log close
      name:  <unnamed>
       log:  /home/kolesarm/research/R-packages/multe/data-raw/fryer_levitt_tests.log
  log type:  text
 closed on:   2 Aug 2023, 15:37:52
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
