-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/kolesarm/research/R-packages/multe/data-raw/fryer_levitt_tests.log
  log type:  text
 opened on:   3 Aug 2023, 12:55:58

. use mental.dta, clear

. 
. global base_9months "i.age_9 female"

. global base_2years "i.age_24 female"

. global prenatal "i.birthweight i.days_premature i.multiple_birth"

. global home "i.siblings i.family_structure i.region c.mom_age##c.mom_age##c.mom_age##c.mom_age##c.mom_age mom_age_NA c.parent_score##c.parent_score##c.parent_score##c.parent_score##c.parent_score parent_score_NA"

. 
. qui: eststo r1: reg std_iq_24 i.race $base_2years [pw=W2C0], robust

. qui: mlogit race $base_2years [pw=W2C0], robust

. disp e(chi2)
44.380661

. disp e(df_m)
16

. disp e(p)
.00017261

. 
. qui: eststo r2: reg std_iq_24 i.race $base_2years, robust

. qui: mlogit race $base_2years, robust

. disp e(chi2)
55.247999

. disp e(df_m)
16

. disp e(p)
3.237e-06

. 
. * ATE
. tabulate age_24, generate(age_24a)

     age_24 |      Freq.     Percent        Cum.
------------+-----------------------------------
         23 |      3,481       39.53       39.53
         24 |      3,415       38.78       78.31
         25 |      1,177       13.37       91.68
         26 |        733        8.32      100.00
------------+-----------------------------------
      Total |      8,806      100.00

. drop age_24a4

. foreach v of varlist age_24a* female  {
  2.     qui: summarize `v'
  3.     generate `v'd = `v' - r(mean)
  4. }

. foreach v of varlist age_24a* female  {
  2.     qui: summarize `v' [w=W2C0]
  3.     generate `v'w = `v' - r(mean)
  4. }

. 
. qui: eststo r3: reg std_iq_24 i.race##c.femaled i.race##c.age_24a*d, robust

. qui: eststo r4: reg std_iq_24 i.race##c.femalew i.race##c.age_24a*w [pw=W2C0], robust

. 
. esttab r1 r2 r3 r4, b(%13.11f) se(%13.11f) wide keep(*.race)

--------------------------------------------------------------------------------------------------------------------------------
                      (1)                          (2)                          (3)                          (4)                
                std_iq_24                    std_iq_24                    std_iq_24                    std_iq_24                
--------------------------------------------------------------------------------------------------------------------------------
0.race       0.00000000000             (.) 0.00000000000             (.) 0.00000000000             (.) 0.00000000000             (.)
1.race       -0.38214850861*** (0.02719998765) -0.40307948873*** (0.02255093624) -0.40288196461*** (0.02261904824) -0.38224046376*** (0.02711806252)
2.race       -0.43152780424*** (0.02417352945) -0.37190206761*** (0.01986720365) -0.37246500815*** (0.01988929344) -0.43220093709*** (0.02410508539)
3.race       -0.21524163702*** (0.03530655165) -0.02956472195    (0.02849451882) -0.03029817036    (0.02850617942) -0.21494788553*** (0.03521886966)
4.race       -0.23674243795*** (0.03861460940) -0.14465188134*** (0.02519070865) -0.14366763851*** (0.02521682508) -0.23918436629*** (0.03811401253)
--------------------------------------------------------------------------------------------------------------------------------
N                    8806                         8806                         8806                         8806                
--------------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. * qui: eststo r4: areg std_iq_24 i.race $base_2years i.SES_quintile $home $prenatal [pw=W2C0] , absorb(interviewer_ID_24)
. 
. log close
      name:  <unnamed>
       log:  /home/kolesarm/research/R-packages/multe/data-raw/fryer_levitt_tests.log
  log type:  text
 closed on:   3 Aug 2023, 12:55:59
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
